tutorials/compressible/sonicFoam/ras/prism/0/U
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (650 0 0);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (650 0 0);
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    bottomWall      
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            (650 0 0);
        gamma           1.28418;
        value           uniform (650 0 0);
    }

    topWall         
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            (650 0 0);
        gamma           1.28418;
        value           uniform (650 0 0);
    }

    prismWall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    defaultFaces    
    {
        type            empty;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
