tutorials/compressible/sonicFoam/ras/prism/0/T
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    bottomWall      
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    topWall         
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    prismWall       
    {
        type            zeroGradient;
    }

    defaultFaces    
    {
        type            empty;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
